app/controllers/meetings_controller.rb

  def index
    @meetings = Meeting.all
---
SELECT "meetings".* FROM "meetings"



    respond_to do |format|
      if @meeting.save
---
INSERT INTO "meetings" ("name", "description", "start_time", "end_time", "users_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @meeting.destroy
---
DELETE FROM "meetings" WHERE "meetings"."id" = $1  [["id", 28]]

    def set_meeting
      @meeting = Meeting.find(params[:id])
---
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]