app/controllers/users_controller.rb

INSERT INTO "users" ("username", "kanji_name", "firstname", "lastname", "email", "email2", "age", "address", "zip_code", "mobile_phone", "emagency_phone", "emagency_zokugara", "emagency_name", "emagency_kana", "name_kana", "lesson_kaisu", "lesson_nobekaisu", "join_date", "lesson_styles_id", "fee_howtos_id", "level_kibous_id", "level_kakuteis_id", "pinano_histories_id", "pinano_owned_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "meetings".* FROM "meetings" WHERE "meetings"."users_id" = $1  [["users_id", 11]]
---
  def usergamen
    @meetings = Meeting.where(users_id: current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def usershow
    ##binding.pry
    @user = User.find(current_user.id)